blog/solve-sudokus-kanren.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-09 Thu 09:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solve sudokus with kanren</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Solve sudokus with kanren</h1>
<p>
I am reminded today of Peter Norvig's <a target='_blank' rel='noopener noreferrer' class='external' href="http://norvig.com/sudoku.html">blog post</a> on solving every sudoku puzzle using constraint propagation and search.
</p>

<p>
This should be realtively easy to implement in python using <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pythological/kanren">kanren</a>, since kanren does the heavy lifting for both these things.
</p>

<p>
We store the sudoku grid as a 81-element list. Since constraints are defines on rows, columns and squares we need to be able to extract those squares.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> lall, permuteo


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">rows</span>(grid):
    <span style="font-style: italic;">"""Return a grid's rows."""</span>
    <span style="font-weight: bold; font-style: italic;">column_idx</span> = [[i + 9*j <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(9)] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(9)]
    <span style="font-weight: bold;">return</span> [[grid[i] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> column] <span style="font-weight: bold;">for</span> column <span style="font-weight: bold;">in</span> columns_idx]


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">columns</span>(grid):
    <span style="font-style: italic;">"""Return a grid's rows."""</span>
    <span style="font-weight: bold; font-style: italic;">row_idx</span> = [[9*i+ j <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(9)] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(9)]
    <span style="font-weight: bold;">return</span> [[grid[i] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> row] <span style="font-weight: bold;">for</span> row <span style="font-weight: bold;">in</span> row_idx]


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">squares</span>(grid):
    <span style="font-style: italic;">"""Return a grid's squares."""</span>
    <span style="font-weight: bold; font-style: italic;">square_idx</span> = [[9*i + j <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> a <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> b] <span style="font-weight: bold;">for</span> a <span style="font-weight: bold;">in</span> ((0, 1, 2), (3, 4, 5), (6, 7, 8)) <span style="font-weight: bold;">for</span> b <span style="font-weight: bold;">in</span> ((0, 1, 2), (3, 4, 5), (6, 7, 8))]
    <span style="font-weight: bold;">return</span> [[grid[i] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> square] <span style="font-weight: bold;">for</span> square <span style="font-weight: bold;">in</span> square_idx]


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sudokuo</span>(grid_expr):
    <span style="font-style: italic;">"""Express a goal that represents the relation between all sudoku grids.</span>

<span style="font-style: italic;">    A sudoku puzzle is said to be solved if every column, every row and every</span>
<span style="font-style: italic;">    square is a permutation of the digits from 1 to 9.</span>
<span style="font-style: italic;">    """</span>
    <span style="font-weight: bold; font-style: italic;">rows_permuteo</span> = [permuteo(row, numbers) <span style="font-weight: bold;">for</span> row <span style="font-weight: bold;">in</span> rows(grid_expr)]
    <span style="font-weight: bold; font-style: italic;">columns_permuteo</span> = [permuteo(column, numbers) <span style="font-weight: bold;">for</span> column <span style="font-weight: bold;">in</span> columns(grid_expr)]
    <span style="font-weight: bold; font-style: italic;">squares_permuteo</span> = [permuteo(square, numbers) <span style="font-weight: bold;">for</span> square <span style="font-weight: bold;">in</span> squares(grid_expr)]

    <span style="font-weight: bold;">return</span> lall(*row_constraints, *column_constraints, *square_constraints)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> permuteo, var, lall

<span style="font-weight: bold; font-style: italic;">numbers</span> = (1, 2, 3, 4, 5, 6, 7, 8, 9)

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">solve_sudoku</span>(grid):

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Flatten the grid</span>
    <span style="font-weight: bold; font-style: italic;">grid_flat</span> = [<span style="font-weight: bold;">int</span>(elem) <span style="font-weight: bold;">for</span> row <span style="font-weight: bold;">in</span> grid <span style="font-weight: bold;">for</span> elem <span style="font-weight: bold;">in</span> row.split(<span style="font-style: italic;">" "</span>)]
    <span style="font-weight: bold;">assert</span> <span style="font-weight: bold;">len</span>(grid_flat) == 81
    <span style="font-weight: bold;">assert</span> <span style="font-weight: bold;">max</span>(grid_flat) == 9

    <span style="font-weight: bold; font-style: italic;">grid_expr</span> = [x <span style="font-weight: bold;">if</span> x &gt; 0 <span style="font-weight: bold;">else</span> var() <span style="font-weight: bold;">for</span> row <span style="font-weight: bold;">in</span> grid_flat <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> row ]

    <span style="font-weight: bold; font-style: italic;">res</span> = run(1, grid_expr, sudokuo)
    <span style="font-weight: bold;">try</span>:
        <span style="font-weight: bold; font-style: italic;">res</span> = res[0]
        <span style="font-weight: bold; font-style: italic;">grid_solved</span> = [[res[9*i+j] <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(9)] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(9)]
        <span style="font-weight: bold;">return</span> grid_solved
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>(<span style="font-style: italic;">"Could not solve this sudoku grid"</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">test</span> = [
     <span style="font-style: italic;">"0 0 0 2 6 0 7 0 1"</span>,
     <span style="font-style: italic;">"6 8 0 0 7 0 0 9 0"</span>,
     <span style="font-style: italic;">"1 9 0 0 0 4 5 0 0"</span>,
     <span style="font-style: italic;">"8 2 0 1 0 0 0 4 0"</span>,
     <span style="font-style: italic;">"0 0 4 6 0 2 9 0 0"</span>,
     <span style="font-style: italic;">"0 5 0 0 0 3 0 2 8"</span>,
     <span style="font-style: italic;">"0 0 9 3 0 0 0 7 4"</span>,
     <span style="font-style: italic;">"0 4 0 0 5 0 0 3 6"</span>,
     <span style="font-style: italic;">"7 0 3 0 1 8 0 0 0"</span>
]
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rémi Louf</p>
<p class="email">Email: <a href="mailto:remi@thetypicalset.com">remi@thetypicalset.com</a></p>
<p class="date">Created: 2022-06-09 Thu 09:28</p>
</div>
</body>
</html>
